## Ipv6


R1(config-if)#INT G0/1 <br/>
R1(config-if)#ipv add fe80::1 link-local<br/>
R1(config-if)#ipv add 2001:db8:2::1/64<br/>
<br/>
R1(config-if)#no sh<br/>
<br/>
exit<br/>
ipv6 unicast-routing<br/>
<br/>
R2(config)#int range g0/0,l0,g0/1<br/>
R2(config-if-range)#ipv add fe80::2 link-local <br/>
R2(config-if-range)#int g0/0<br/>
R2(config-if)#ipv add 12::2/64<br/>
R2(config-if)#int g0/1        <br/>
R2(config-if)#ipv add 23::2/64<br/>
R2(config-if)#int l0<br/>
R2(config-if)#ipv add 2::2/64 <br/>
<br/>
<br/>
R3(config)#int range g0/1,l0<br/>
R3(config-if-range)#ipv add fe80::3 link-local <br/>
R3(config-if-range)#no sh<br/>
R3(config-if-range)#int g0/1<br/>
R3(config-if)#ipv add 23::3/64<br/>
R3(config-if)#int l0 <br/>
R3(config-if)#ipv add 3::3/64 <br/>
R3(config-if)#exit<br/>
R3(config)#ipv unicast-routing<br/>
<br/>
R1(config)#ipv route ::/0 12::2 <-- ::/0은 0.0.0.0을 뜻함<br/>
R3(config)#ipv route ::/0 23::2 <-- ::/0은 0.0.0.0을 뜻함<br/>
<br/>
R2(config)#ipv route 1::/64 12::1<br/>
R2(config)#ipv route 3::/64 23::3<br/>
<br/>
<br/>
R1#ping 2::2 so l0<br/>
Type escape sequence to abort.<br/>
Sending 5, 100-byte ICMP Echos to 2::2, timeout is 2 seconds:<br/>
Packet sent with a source address of 1::1<br/>
!!!!!<br/>
Success rate is 100 percent (5/5), round-trip min/avg/max = 1/1/1 ms<br/>
R1#ping 3::3 so l0<br/>
Type escape sequence to abort.<br/>
Sending 5, 100-byte ICMP Echos to 3::3, timeout is 2 seconds:<br/>
Packet sent with a source address of 1::1<br/>
!!!!!<br/>
Success rate is 100 percent (5/5), round-trip min/avg/max = 1/1/3 ms<br/>


## Kali

root@Toolbox-1:~# nano /etc/dhcp/dhcpd.conf<br/>
subnet 30.1.1.0 netmask 255.255.255.0 {<br/>
   range 30.1.1.101 30.1.1.200;<br/>
   option routers 30.1.1.6;     <br/>
   option domain-name-servers 8.8.8.8;<br/>
}<br/>
<br/>
← 상대방에게 거짓 게이트웨이 주소를 삽입 시킨다.<br/>
<br/>
<br/>

SW1(config)#ip dhcp snooping <br/>
SW1(config)#ip dhcp snooping vlan 1<br/>
SW1(config)#int g0/1<br/>
SW1(config-if)#ip dhcp snooping trust <br/>
SW1(config)#no ip dhcp snooping information option <br/>
SW1#sh ip dhcp snooping binding <br/>
<br/>

칼리에서 실행 명령어<br/>
38  ping 8.8.8.8<br/>
   39  route<br/>
   40  ifconfig eth0 down<br/>
   41  ifconfig eth0 up<br/>
   42  ifconfig eth0 <br/>
   43  route<br/>
   44  ifconfig eth0 <br/>
   45  ifconfig eth0 down<br/>
   46  ifconfig eth0 up<br/>
   47  ifconfig eth0 <br/>
   48  route<br/>
   49  ping 30.1.1.254<br/>
   50  ping 8.8.8.8<br/>
<br/>
<br/>
<br/>

SW1(config)#ip dhcp snooping <br/>
SW1(config)#int range g0/2-3<br/>
SW1(config-if-range)#ip dhcp snooping limit rate 10<br/>
SW1(config)#errdisable recovery cause dhcp-rate-limit <br/>
SW1(config)#errdisable recovery interval 30<br/>



















